//---------------------------------------------------------------------------
// Sword3 Engine (c) 1999-2000 by Kingsoft
//
// File:	KStrNode.cpp
// Date:	2000.08.08
// Code:	WangWei(Daphnis)
// Desc:	Simple double linked node class
//---------------------------------------------------------------------------
#include "KWin32.h"
#include "KDebug.h"
#include "KMemBase.h"
#include "KStrNode.h"
//---------------------------------------------------------------------------
// 函数:	KStrNode
// 功能:	构造
// 参数:	void
// 返回:	void
//---------------------------------------------------------------------------
KStrNode::KStrNode(void)
{
	g_MemZero(m_Name, sizeof(m_Name));
}
//--------------------------------------------------------------------------------
